[
  {
    "date": "2026-02-22",
    "title": "V 1.1.1",
    "content": "Обновлены правила для попадания в челлендж лист."
  },
  {
    "date": "2026-01-29",
    "title": "V 1.1.0",
    "content": "Полностью переделан дизайн сайта. Удалена квладка \"Контакты\". Удалена возможность смены темы. Мемори челлендж лист объеденён с простым челлендж листом. Реквесты теперь на одной странице. Добавлены правила отправки реквестов. На главную страницу добавлено: стафф, текущая статистика топов. Чейндж логи перенесены в подвал сайта. Добавлены фильтры для демон листа и илл. Теперь нельзя кинуть вериф если верифер не зарегистрирован. Обновлена система картинок уровней - теперь это превью с верифа. Пофикшены мелкие баги, а так же обновлена адаптация для мобильных устройств. Политика конфиденциальности обновлена и перенесена на главную страницу в пункт \"О нас\". ИЛЛ вновь работает и теперь это список неверифнутых уровней. Добавлена система ошибок на сайте. Кнопка просмотра викторов временно удалена и находится на переработке. Добвалены вкладки \"Крутые люди\" и \"Скиллсеты (инфо)\". Обновлена адаптация для мобильных устройств. Добавлено описание уровней (берётся из описания уровня в самом гдпсе)."
  },
  {
    "date": "2025-12-6",
    "title": "V 1.0.9",
    "content": "Добавлена возможность смены темы сайта. "
  },
  {
    "date": "2025-12-05",
    "title": "V 1.0.8",
    "content": "Сделан небольшой редизайн сайта. Обновлена страница контактов."
  },
  {
    "date": "2025-11-25",
    "title": "V 1.0.7",
    "content": "Видоизменен дизайн некоторых элементов интерфейса. Добавлены новые анимации. Проведена переработка опыта — он был заменен на звезды. Полностью переделан подвал сайта. Добавлены МЧЛ (Мемори Челлендж Лист) и ИЛЛ (Импосибл Левел Лист). Добавлены правила для попадания в список игроков. Добавлены правила для добавления уровня в лист. Добавлены правила для отправки виктора. Добавлены скиллсеты на уровни. В меню демона добавлена сложность его сложность на ГДПС`е. Обновлено модальное окно уровней. Добавлена возможность просмотра викторов. Добавлена возможность посмотреть прохождение в профиле игрока. Дата прохождения может быть неточной (используется дата отправки реквеста или видео). Добавлена новая вкладка «Отправка Импосибла»"
  },
  {
    "date": "2025-11-20",
    "title": "V 1.0.6",
    "content": "Обновлены все вкладки в реквестах."
  },
  {
    "date": "2025-11-18",
    "title": "V 1.0.5",
    "content": "Изменен опыт за прохождение уровней."
  },
  {
    "date": "2025-11-17",
    "title": "V 1.0.4",
    "content": "Добавлен лист игроков. Исправлены баги с отображением некоторых элементов на мобильных устройствах. Сделана небольшая оптимизация сайта. Сделана регистрация в \"Реквесты\". "
  },
  {
    "date": "2025-11-16",
    "title": "V 1.0.3",
    "content": "Сделан полный редизайн и рекодинг сайта. Пофикшены мелкие баги. Добавлен поиск уровней в листах. Добавлена вкладка \"Контакты\". Немного обновлена политика конфиденциальности. Добавлено копирование айди по клику на него."
  },
  {
    "date": "2025-11-10",
    "title": "V 1.0.2",
    "content": "Добавлены: \"Чейндж-Лог\", \"Инфо о сайте\", \"Отправить вериф\", \"Отправить шоукейс\". Мелкие багфиксы. Сделана политика, разрешение и отказ от ответственности."
  },
  {
    "date": "2025-10-20",
    "title": "V 1.0.1",
    "content": "Исправлены отступы, добавлена адаптация для мобильных устройств и изменена фоновая картинка."
  }
]
